Autodesk.Revit.DB.FilePath.#ctor(System.String)
Constructs a FilePath
path:
The path to the file. This path does not
have to be a full path; it can be relative.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.FilePath
This class represents a path on a disk or network location, but
not a path to a Revit server location.
Since:
2012